import axios from "axios";

export const ERROR_MESSAGES = {
  "SQLITE_CONSTRAINT: UNIQUE constraint failed: reasons.title": "Запись с таким значением уже сущесвует",
  "SQLITE_CONSTRAINT: FOREIGN KEY constraint failed": "Отсутсвует родительское значение"
}

export const initialGetCardsSql = `
  select
   C.id,
   C.ls_abon,
   C.account_id,
   C.n_result_id,
   C.created_at,
   C.spec_full_name,
   C.sip,
   C.full_name,
   C.phone_number,
   call_from,
   C.address,
   C.mac_address,
   C.ip_address,
   C.mac_onu,
   C.ip_olt,
   C.comment,
   R.id as reason_id,
  R.title as reason_title,
  S.id as solution_id,
  S.title as solution_title from cards as C
  left join reasons as R on R.id = C.reason_id
  left join solutions as S on S.id = C.solution_id
`;

const login = 'asyl';
const password = '*hjvfirf';
export let token = '';

export const authorize = async () => {
  try {
    const req = await axios.post(`https://hydra.snt.kg:8000/rest/v2/login`, {
      session: {
        login,
        password
      }
    });
    
    token = await req.data?.session?.token;
    return token;
  } catch (e) {
    return e.message;
  }
};

const reasons = [
  {
    "id": 1,
    "title": "Не работает интернет"
  },
  {
    "id": 2,
    "title": "Смена ТП"
  },
  {
    "id": 3,
    "title": "Исходящий звонок"
  },
  {
    "id": 4,
    "title": "Ошибочный звонок"
  },
  {
    "id": 5,
    "title": "Жалобы на радиус охвата роутера"
  },
  {
    "id": 6,
    "title": "Авария/проф. работы"
  },
  {
    "id": 7,
    "title": "Callback"
  },
  {
    "id": 8,
    "title": "Жалобы на скорость"
  },
  {
    "id": 9,
    "title": "Двойное списание в биллинге"
  },
  {
    "id": 10,
    "title": "Ждет демонтаж"
  },
  {
    "id": 11,
    "title": "Ждет перенос"
  },
  {
    "id": 12,
    "title": "Ждет подключения"
  },
  {
    "id": 13,
    "title": "Желает подключиться"
  },
  {
    "id": 14,
    "title": "Желает получить стат IP адрес"
  },
  {
    "id": 15,
    "title": "Вопрос по оплате"
  },
  {
    "id": 16,
    "title": "Отказ от услуг"
  },
  {
    "id": 17,
    "title": "Жалоба"
  },
  {
    "id": 18,
    "title": "Пульт сломался"
  },
  {
    "id": 19,
    "title": "Смена пароля от роутера"
  },
  {
    "id": 20,
    "title": "Временная блокировка/пауза"
  },
  {
    "id": 21,
    "title": "Ждет Техпод"
  },
  {
    "id": 22,
    "title": "Звонок от сервис инженера"
  },
  {
    "id": 23,
    "title": "Интерком"
  },
  {
    "id": 24,
    "title": "ТВ/приставка/приложение"
  },
  {
    "id": 25,
    "title": "Перенос"
  },
  {
    "id": 26,
    "title": "Установка доп оборудования"
  },
  {
    "id": 27,
    "title": "Перевод на другую линию"
  },
  {
    "id": 28,
    "title": "Консультация"
  }
];

const solutions = [
  {
    "id": 1,
    "reason_id": 1,
    "title": "Замена бп/роутера заявка"
  },
  {
    "id": 2,
    "reason_id": 1,
    "title": "Перевел (а) на вторую линию"
  },
  {
    "id": 3,
    "reason_id": 1,
    "title": "Настройка конфигураций роутера"
  },
  {
    "id": 4,
    "reason_id": 1,
    "title": "Отрицательный баланс, кредит"
  },
  {
    "id": 5,
    "reason_id": 1,
    "title": "Исправили топологию подключения кабеля"
  },
  {
    "id": 6,
    "reason_id": 1,
    "title": "Неисправность ОНУ, заявка"
  },
  {
    "id": 7,
    "reason_id": 1,
    "title": "Перезагрузил (роутер/ону)"
  },
  {
    "id": 8,
    "reason_id": 1,
    "title": "Перезагрузил порт (ОНУ)"
  },
  {
    "id": 9,
    "reason_id": 1,
    "title": "Вопрос не решен, перезвон..."
  },
  {
    "id": 10,
    "reason_id": 1,
    "title": "Заявка тех под - Диагностика"
  },
  {
    "id": 11,
    "reason_id": 1,
    "title": "Заявка тех под - Обрыв"
  },
  {
    "id": 12,
    "reason_id": 1,
    "title": "Заявка тех под - Замена оборудования/комплект"
  },
  {
    "id": 13,
    "reason_id": 1,
    "title": "Заявка тех под - Улучшение сигналов"
  },
  {
    "id": 14,
    "reason_id": 1,
    "title": "Заявка тех под - Настройка оборудования"
  },
  {
    "id": 15,
    "reason_id": 1,
    "title": "Поменяли Роутер"
  },
  {
    "id": 16,
    "reason_id": 1,
    "title": "Устройства были отключены, подключили"
  },
  {
    "id": 17,
    "reason_id": 1,
    "title": "Юрик, передан в ОМОС"
  },
  {
    "id": 18,
    "reason_id": 1,
    "title": "Партнерка, передали партнерам"
  },
  {
    "id": 19,
    "reason_id": 1,
    "title": "Неверный влан, исправлен"
  },
  {
    "id": 20,
    "reason_id": 1,
    "title": "Сброс роутера"
  },
  {
    "id": 21,
    "reason_id": 2,
    "title": "Поменял(а)"
  },
  {
    "id": 22,
    "reason_id": 2,
    "title": "Передано В ОКП"
  },
  {
    "id": 23,
    "reason_id": 2,
    "title": "Запланировал(а)"
  },
  {
    "id": 24,
    "reason_id": 3,
    "title": "wire-down, заявка не нужна"
  },
  {
    "id": 25,
    "reason_id": 3,
    "title": "уточнение сроков у СИ"
  },
  {
    "id": 26,
    "reason_id": 3,
    "title": "перезвон абоненту, чтобы сообщить сроки"
  },
  {
    "id": 27,
    "reason_id": 3,
    "title": "обработанный файл, уточнение"
  },
  {
    "id": 28,
    "reason_id": 3,
    "title": "актуализация номера"
  },
  {
    "id": 29,
    "reason_id": 3,
    "title": "актуализация заявки на ТП"
  },
  {
    "id": 30,
    "reason_id": 4,
    "title": "Не наш абонент"
  },
  {
    "id": 31,
    "reason_id": 4,
    "title": "Ошиблись номером"
  },
  {
    "id": 32,
    "reason_id": 5,
    "title": "установка доп. роутер"
  },
  {
    "id": 33,
    "reason_id": 5,
    "title": "перенос роутера"
  },
  {
    "id": 34,
    "reason_id": 6,
    "title": "Проф. работы, проконсультирован"
  },
  {
    "id": 35,
    "reason_id": 6,
    "title": "Авария - муниципалитет"
  },
  {
    "id": 36,
    "reason_id": 6,
    "title": "Авария - РЭС"
  },
  {
    "id": 37,
    "reason_id": 6,
    "title": "Авария - вышестоящий провайдер"
  },
  {
    "id": 38,
    "reason_id": 6,
    "title": "Авария - ОВК"
  },
  {
    "id": 39,
    "reason_id": 6,
    "title": "Авария - АКБ"
  },
  {
    "id": 40,
    "reason_id": 6,
    "title": "Авария - падение оборудования"
  },
  {
    "id": 41,
    "reason_id": 6,
    "title": "Авария - падение порта"
  },
  {
    "id": 42,
    "reason_id": 6,
    "title": "Авария - ASR"
  },
  {
    "id": 43,
    "reason_id": 6,
    "title": "Проф. работы - Элкат"
  },
  {
    "id": 44,
    "reason_id": 6,
    "title": "Авария - скорость в мир"
  },
  {
    "id": 45,
    "reason_id": 6,
    "title": "Авария - Конфигурация ОЛТ"
  },
  {
    "id": 46,
    "reason_id": 7,
    "title": "Не взяли трубку"
  },
  {
    "id": 47,
    "reason_id": 8,
    "title": "Перевел (а) на вторую линию"
  },
  {
    "id": 48,
    "reason_id": 8,
    "title": "Множество устройств, использующих одну сеть – смена пароля, повышение тп, доп роутер"
  },
  {
    "id": 49,
    "reason_id": 8,
    "title": "Плохие сигналы (-26 и ниже), заявка"
  },
  {
    "id": 50,
    "reason_id": 8,
    "title": "Маленький радиус охвата роутера – Перенос роутера или доп роутер"
  },
  {
    "id": 51,
    "reason_id": 8,
    "title": "Настройка конфигураций роутера (канал вещания и сеть 5G)"
  },
  {
    "id": 52,
    "reason_id": 8,
    "title": "Смена ТП повышения – при наличии 5G, доп роутер"
  },
  {
    "id": 53,
    "reason_id": 8,
    "title": "Вопрос не решен, перезвон"
  },
  {
    "id": 54,
    "reason_id": 8,
    "title": "Удаленная диагностика не помогла, оформили выезд"
  },
  {
    "id": 55,
    "reason_id": 8,
    "title": "Роутер 844, забиты каналы на 2.4 ггц, продажа роутера или замена на Archer C24(5G)"
  },
  {
    "id": 56,
    "reason_id": 8,
    "title": "VPN включен"
  },
  {
    "id": 57,
    "reason_id": 8,
    "title": "Жалобы на пинг"
  },
  {
    "id": 58,
    "reason_id": 9,
    "title": "Бухгалтерия, корректировка"
  },
  {
    "id": 59,
    "reason_id": 10,
    "title": "Передали сервис инженерам/ Озвучили сроки"
  },
  {
    "id": 60,
    "reason_id": 11,
    "title": "Передали сервис инженерам/ Озвучили сроки"
  },
  {
    "id": 61,
    "reason_id": 11,
    "title": "Вопрос не решен, перезвон"
  },
  {
    "id": 62,
    "reason_id": 11,
    "title": "НТВ, передано в ОЗК"
  },
  {
    "id": 63,
    "reason_id": 12,
    "title": "Передали сервис инженерам/Озвучили сроки"
  },
  {
    "id": 64,
    "reason_id": 12,
    "title": "Нет техничекой возможности, озвучили"
  },
  {
    "id": 65,
    "reason_id": 12,
    "title": "отмена заявки на подкл"
  },
  {
    "id": 66,
    "reason_id": 13,
    "title": "Перенаправили в ТМ"
  },
  {
    "id": 67,
    "reason_id": 13,
    "title": "Оформлен лид"
  },
  {
    "id": 68,
    "reason_id": 13,
    "title": "Оформлена заявка на подключение"
  },
  {
    "id": 69,
    "reason_id": 13,
    "title": "Передал(а) в Корп"
  },
  {
    "id": 70,
    "reason_id": 14,
    "title": "Задача в ОМОС"
  },
  {
    "id": 71,
    "reason_id": 15,
    "title": "Консультация по тарифному плану"
  },
  {
    "id": 72,
    "reason_id": 15,
    "title": "Доверительный платеж с 1 по 4 числа"
  },
  {
    "id": 73,
    "reason_id": 15,
    "title": "Узнал сколько к оплате"
  },
  {
    "id": 74,
    "reason_id": 15,
    "title": "Перерасчет"
  },
  {
    "id": 75,
    "reason_id": 15,
    "title": "Уточнил, как оплачивать"
  },
  {
    "id": 76,
    "reason_id": 15,
    "title": "Уточнение баланса"
  },
  {
    "id": 77,
    "reason_id": 15,
    "title": "Не хватило, отрицательный баланс"
  },
  {
    "id": 78,
    "reason_id": 15,
    "title": "Не знает расчетный период, проконсультирован"
  },
  {
    "id": 79,
    "reason_id": 15,
    "title": "Ошибочное списание UPT/оборудование"
  },
  {
    "id": 80,
    "reason_id": 16,
    "title": "Передали в ОЗК, нет надобности"
  },
  {
    "id": 81,
    "reason_id": 16,
    "title": "Передали в ОЗК, перенос НТВ"
  },
  {
    "id": 82,
    "reason_id": 16,
    "title": "Передали в ОЗК, фин трудности"
  },
  {
    "id": 83,
    "reason_id": 16,
    "title": "Передали в ОЗК, переезд заграницу"
  },
  {
    "id": 84,
    "reason_id": 16,
    "title": "Передали в ОЗК, частые аварии"
  },
  {
    "id": 85,
    "reason_id": 16,
    "title": "Передали в ОЗК, дети злоупотребляют"
  },
  {
    "id": 86,
    "reason_id": 16,
    "title": "Удержан, нет надобности"
  },
  {
    "id": 87,
    "reason_id": 16,
    "title": "Удержан, фин друдности"
  },
  {
    "id": 88,
    "reason_id": 16,
    "title": "Удержан, частые аварии"
  },
  {
    "id": 89,
    "reason_id": 16,
    "title": "Удержан, есть мобильный интернет"
  },
  {
    "id": 90,
    "reason_id": 16,
    "title": "Передали в ОЗК, есть мобильный интернет"
  },
  {
    "id": 91,
    "reason_id": 16,
    "title": "Удержан, ждет СИ"
  },
  {
    "id": 92,
    "reason_id": 16,
    "title": "Передали в ОЗК, ждет СИ"
  },
  {
    "id": 93,
    "reason_id": 16,
    "title": "Передали в ОЗК, периодически не работает интернет"
  },
  {
    "id": 94,
    "reason_id": 16,
    "title": "Передали в ОЗК, переезд"
  },
  {
    "id": 95,
    "reason_id": 16,
    "title": "Передали в ОЗК, акция Саймы"
  },
  {
    "id": 96,
    "reason_id": 16,
    "title": "Передали в ОЗК, частые техподы"
  },
  {
    "id": 97,
    "reason_id": 16,
    "title": "Удержан, дети злоупотребляют"
  },
  {
    "id": 98,
    "reason_id": 16,
    "title": "Передали в ОЗК, отказ оплачивать за оборудование"
  },
  {
    "id": 99,
    "reason_id": 16,
    "title": "Передали в ОЗК, дорогой ТП"
  },
  {
    "id": 100,
    "reason_id": 17,
    "title": "жалоба на сроки выполнения"
  },
  {
    "id": 101,
    "reason_id": 17,
    "title": "жалоба на качество услуг"
  },
  {
    "id": 102,
    "reason_id": 17,
    "title": "жалоба на сотрудника"
  },
  {
    "id": 103,
    "reason_id": 17,
    "title": "жалоба на неэффективное решение СИ"
  },
  {
    "id": 104,
    "reason_id": 17,
    "title": "жалоба на неэффективное решение КП"
  },
  {
    "id": 105,
    "reason_id": 17,
    "title": "передали в ОЗК"
  },
  {
    "id": 106,
    "reason_id": 18,
    "title": "Заявка на пульт д/у придет в офис"
  },
  {
    "id": 107,
    "reason_id": 18,
    "title": "Скачали приложение"
  },
  {
    "id": 108,
    "reason_id": 19,
    "title": "Консультация"
  },
  {
    "id": 109,
    "reason_id": 19,
    "title": "Перевел(а) на вторую линию"
  },
  {
    "id": 110,
    "reason_id": 19,
    "title": "Настройка роутера"
  },
  {
    "id": 111,
    "reason_id": 20,
    "title": "Поставил (а)"
  },
  {
    "id": 112,
    "reason_id": 21,
    "title": "Передали сервис инженерам/ озвучили сроки приезда"
  },
  {
    "id": 113,
    "reason_id": 21,
    "title": "отмена заявки на техпод"
  },
  {
    "id": 114,
    "reason_id": 22,
    "title": "Подключил"
  },
  {
    "id": 115,
    "reason_id": 22,
    "title": "Тех под"
  },
  {
    "id": 116,
    "reason_id": 22,
    "title": "Подключили ТВ"
  },
  {
    "id": 117,
    "reason_id": 23,
    "title": "Уточнение баланса/оплаты/лс"
  },
  {
    "id": 118,
    "reason_id": 23,
    "title": "Не работает домофон/не показывают камеры"
  },
  {
    "id": 119,
    "reason_id": 23,
    "title": "Смена пароля"
  },
  {
    "id": 120,
    "reason_id": 23,
    "title": "Не работает приложения"
  },
  {
    "id": 121,
    "reason_id": 23,
    "title": "Передали Специалистам"
  },
  {
    "id": 122,
    "reason_id": 23,
    "title": "Чип/консультация"
  },
  {
    "id": 123,
    "reason_id": 24,
    "title": "Авторизация"
  },
  {
    "id": 124,
    "reason_id": 24,
    "title": "Замена HDMI"
  },
  {
    "id": 125,
    "reason_id": 24,
    "title": "Переподключили HDMI и проверили источники сигналов"
  },
  {
    "id": 126,
    "reason_id": 24,
    "title": "Замена Приставки (Заявка)"
  },
  {
    "id": 127,
    "reason_id": 24,
    "title": "Переподключили UTP кабель"
  },
  {
    "id": 128,
    "reason_id": 24,
    "title": "Замена UTP, выезд"
  },
  {
    "id": 129,
    "reason_id": 24,
    "title": "Ждет подключения ТВ - передали сервис инженерам/озвучили сроки"
  },
  {
    "id": 130,
    "reason_id": 24,
    "title": "Желает подключить ТВ - составили заявку"
  },
  {
    "id": 131,
    "reason_id": 24,
    "title": "Выставил (а) подписку"
  },
  {
    "id": 132,
    "reason_id": 24,
    "title": "Перезагрузили ТВ приставку/ТВ (приложение)"
  },
  {
    "id": 133,
    "reason_id": 24,
    "title": "Техработы (авария) СУПЕР ТВ"
  },
  {
    "id": 134,
    "reason_id": 24,
    "title": "Диагностика Приставки (Заявка)"
  },
  {
    "id": 135,
    "reason_id": 24,
    "title": "Spruthub"
  },
  {
    "id": 136,
    "reason_id": 24,
    "title": "Сброс ТВ приставки"
  },
  {
    "id": 137,
    "reason_id": 24,
    "title": "Поменяли качество видео на Авто"
  },
  {
    "id": 138,
    "reason_id": 24,
    "title": "Исправили дату и время"
  },
  {
    "id": 139,
    "reason_id": 24,
    "title": "Переустановили YouTube"
  },
  {
    "id": 140,
    "reason_id": 24,
    "title": "Демонтаж ТВ приставки"
  },
  {
    "id": 141,
    "reason_id": 24,
    "title": "Абонентское ТВ - подключили к сети wi-fi"
  },
  {
    "id": 142,
    "reason_id": 25,
    "title": "Составил заявку"
  },
  {
    "id": 143,
    "reason_id": 25,
    "title": "НТВ, заявка на демонтаж"
  },
  {
    "id": 144,
    "reason_id": 26,
    "title": "Составил (а) заявку на установку"
  },
  {
    "id": 145,
    "reason_id": 26,
    "title": "Настроили доп роутер"
  },
  {
    "id": 146,
    "reason_id": 26,
    "title": "Заявка - подключение доп оборудование"
  },
  {
    "id": 147,
    "reason_id": 27,
    "title": "Переведен на 2-линия"
  },
  {
    "id": 148,
    "reason_id": 27,
    "title": "Переведен в ОЗК"
  },
  {
    "id": 149,
    "reason_id": 27,
    "title": "Переведен в ОМОС"
  },
  {
    "id": 150,
    "reason_id": 28,
    "title": "Узнал ЛС"
  },
  {
    "id": 151,
    "reason_id": 28,
    "title": "Поменял номер"
  },
  {
    "id": 152,
    "reason_id": 28,
    "title": "Узнал про тарифные планы"
  },
  {
    "id": 153,
    "reason_id": 28,
    "title": "Консультация по абонентскому приложению"
  },
  {
    "id": 154,
    "reason_id": 28,
    "title": "Техработы в абонентском приложении"
  },
  {
    "id": 155,
    "reason_id": 28,
    "title": "Уточнил/узнал адрес"
  },
  {
    "id": 156,
    "reason_id": 28,
    "title": "Консультация по ТВ"
  }
];
